<a href="https://colab.research.google.com/github/crzysab/Python-Pandas/blob/main/Pandas_14.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Menggabungkan dua Pandas Data Frame**

___

Import Modules

In [1]:
import pandas as pd
import numpy as np

Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows,n_cols)), columns=cols)

df.head()

    A   B   C   D   E
0   1   8  10   2  17
1  16  14  19   2   6
2  12   1  18  14  12
3   2   2   9   8   8
4  15  12   9  16   2

In [3]:
df1 = df.copy(deep=True)
df1 = df1.drop([1,4])
df1

    A  B   C   D   E
0   1  8  10   2  17
2  12  1  18  14  12
3   2  2   9   8   8

In [4]:
df2 = df.copy(deep=True)
df2 = df2.drop([0,3])
df2

    A   B   C   D   E
1  16  14  19   2   6
2  12   1  18  14  12
4  15  12   9  16   2

Menggabungkan Dua Data Frame

Pendekatan Inner Merge

In [5]:
df_inner = pd.merge(df1, df2, how='inner')
df_inner

    A  B   C   D   E
0  12  1  18  14  12

Pendekatan Outer Merge

In [6]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer

    A   B   C   D   E
0   1   8  10   2  17
1  12   1  18  14  12
2   2   2   9   8   8
3  16  14  19   2   6
4  15  12   9  16   2